### Pandas DataFrame

In [ ]:
import pandas as pd

In [ ]:
'''
Survived	0이면 사망, 1이면 생존	int64
Pclass	    티켓 등급 : 1, 2, 3	int64
Name	    승객 이름 : Surname, Title. Firstname	object
Sex		    성별 : male, female	object
Age		    승객의 나이	float64
SibSp		형제, 자매, 배우자의 합	int64
Parch		부모, 자식의 합	int64
Ticket		티켓 번호	object
Fare		요금	float64
Cabin		객실 번호	object
Embarked	선착장 : C(Cherbourg), Q(Queenstown), S(Southampton)	object
'''

### read_csv()
* read_csv() : csv 파일을 DataFrame 으로 loading 함

In [ ]:
titanic_df = pd.read_csv("titanic_train.csv")
print("titanic_df 의 타입 :",type(titanic_df))

### head()
* DataFrame 의 앞에 있는 5 개의 data를 추출함
* head() 의 () 안에 지정하는 숫자만큼 추출함

In [ ]:
titanic_df.head()

In [ ]:
titanic_df.head(10)

### dictionary 로 DataFrame 생성하기

In [ ]:
dict1 = {
         "Name" : ["이순신", "더조은", "강감찬", "유관순"],
         "Year" : [1545, 1970, 948, 1902],
         "Gender" : ["Male", "Male", "Male", "Female"]
        }

# dictionary 를 DataFrame 으로 변환하기
data_df = pd.DataFrame(dict1)
print(data_df)
print("-" * 50)

In [ ]:
# 새로운 column 명 추가하기
data_df = pd.DataFrame(dict1, columns=["Name", "Year", "Gender", "Age"])
print(data_df)
print("-" * 50)

In [ ]:
# index 이름 변경하기
data_df = pd.DataFrame(dict1, index = ["one", "two", "three", "four"])
print(data_df)
print("-" * 50)

### DataFrame 의 column 명과 index

In [ ]:
print(titanic_df.info())

In [ ]:
print("columns :\n",titanic_df.columns)
print("index   :\n",titanic_df.index)
print("index value :\n",titanic_df.index.values)

### DataFrame 에서 Series 추출하기

In [ ]:
# DataFrame 객체에 []연산자 안에 한 개의 컬럼명을 입력하면 Series 객체로 반환함
series_name = titanic_df["Name"]
print(series_name.head(3))
print("series_name type :",type(series_name))

In [ ]:
series_age = titanic_df["Age"]
print(series_age.head(3))
print("series_age type :",type(series_age))

In [ ]:
# DataFrame 객체에 []연산자 안에 여러 개의 컬럼명을 리스트로 입력하면 
# 해당 컬럼들로 구성된 DataFrame 객체로 반환함
name_age = titanic_df[["Name", "Age"]]
print(name_age.head(3))
print("name_age type :",type(name_age))

In [ ]:
# DataFrame 객체에 []연산자 안에 한 개의 컬럼명을 리스트로 입력하면 
# 해당 컬럼들로 구성된 DataFrame 객체로 반환함
name_df = titanic_df[["Name"]]
print(name_df.head(3))
print("name_df type :",type(name_df))

### shape 속성
* DataFrame 의 행(Row)과 열(Column)의 크기를 가지고 있는 속성

In [ ]:
print("titanic_df.shape :",titanic_df.shape)

### info() 메소드
* DataFrame 내의 컬럼명, 데이터타입, Null건수, 데이터 건수 등의 정보를 반환함

In [ ]:
print("titanic_df.info() :",titanic_df.info())

### describe() 메소드
* 데이터값들의 평균, 표준편차, 4분의 분포도를 반환함
* 숫자형 컬럼들에 대해서만 해당 정보를 반환함

In [ ]:
titanic_df.describe()

### value_counts()
* 같은 값이 몇 건 있는지 알려줌 - 개별 데이터값의 분포도를 제공해 줌
* value_counts() 는 Series 객체에서만 호출할 수 있음
* DataFrame 객체를 Series 객체로 변환해서 호출함

In [ ]:
value_counts = titanic_df["Pclass"].value_counts()
print("value_counts :\n",value_counts,sep="")
print("value_counts 타입 :",type(value_counts))

In [ ]:
titanic_pclass = titanic_df["Pclass"]
print("titanic_pclass 타입 :",type(titanic_pclass))
print("titanic_pclass.head() :\n",titanic_pclass.head(),sep="")

### sort_values()
* by=정렬할컬럼이름, ascending=True(오름차순)-default,False(내림차순)

In [ ]:
titanic_df.sort_values(by="Pclass",ascending=False)

In [ ]:
titanic_df.sort_values(by="Pclass")

In [ ]:
titanic_df[["Name", "Age"]].sort_values(by="Age")

In [ ]:
titanic_df[["Name","Age","Pclass"]].sort_values(by="Age")

In [ ]:
# by=["Pclass","Age"]
# ㄴ 객실등급으로 오름차순 정렬을 한 뒤
#    객실등급별로 나이로 오름차순 정렬을 함
titanic_df[["Name","Age","Pclass"]].sort_values(by=["Pclass","Age"])

### 아래 부분은 ex02 Numpy 를 학습한 후 공부하세요

### DataFrame, list, dictionary, ndarray 상호 변환하기
* list, ndarray 에서 DataFrame 변환하기

In [ ]:
import numpy as np

col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print("array1 :\n",array1)
print("array1.shape :\n",array1.shape)
print()
print("-" * 50)
print()
list1_df = pd.DataFrame(list1, columns=col_name1)
print("-- 1차원 리스트로 생성한 DataFrame --\n",list1_df)
print()
array1_df = pd.DataFrame(array1, columns=col_name1)
print("-- 1차원 ndarray로 생성한 DataFrame --\n",array1_df)

In [ ]:
# column 명 3 개로 구성된 list 생성하기
col_name2 = ["col1", "col2", "col3"]

# 2행 3열 (2 X 3) 의 리스트와 ndarray 를 생성한 후
# 이들을 DataFrame 으로 변환하기
list2 = [[1, 2, 3], 
         [11, 22, 33]]
array2 = np.array(list2)
print("array2.shape :",array2.shape)
print()
print("-" * 50)
print()

list2_df = pd.DataFrame(list2, columns=col_name2)
print("-- 2차원 리스트로 생성한 DataFrame --\n",list2_df)
print()
array2_df = pd.DataFrame(array2, columns=col_name2)
print("-- 2차원 ndarray로 생성한 DataFrame --\n",array2_df)

### dictionary 에서  DataFrame 으로 변환하기
* key 는 column 명으로 매핑되고 value 는 column 의 값으로 매핑됨

In [ ]:
dict1 = {"이름":["이순신", "강감찬"], "나이":[48, 72], "출생지":["한성부", "관악구 봉천동"]}
dict1_df = pd.DataFrame(dict1)
print("-- dictionary 로 생성한 DataFrame --\n",dict1_df)

### DataFrame 을 ndarray 로 변환하기

In [ ]:
df2array = dict1_df.values
print("df2array :\n",df2array)
print("df2array :\n",type(df2array))
print("df2array :\n",df2array.shape)

### DataFrame 을 list 로 변환하기

In [ ]:
list3 = dict1_df.values.tolist()
print("list3 :\n",list3)
print("list3 :\n",type(list3))

### DataFrame 을 dictionary 로 변환하기

In [ ]:
dict3 = dict1_df.to_dict("list")
print("dict3 :\n",dict3)
print("dict3 :\n",type(dict3))
print("-" * 40)

dict4 = dict1_df.to_dict()
print("dict4 :\n",dict4)
print("dict4 :\n",type(dict4))
print("-" * 40)

In [ ]:
'''
Survived	0이면 사망, 1이면 생존	int64
Pclass	    티켓 등급 : 1, 2, 3	int64
Name	    승객 이름 : Surname, Title. Firstname	object
Sex		    성별 : male, female	object
Age		    승객의 나이	float64
SibSp		형제, 자매, 배우자의 합	int64
Parch		부모, 자식의 합	int64
Ticket		티켓 번호	object
Fare		요금	float64
Cabin		객실 번호	object
Embarked	선착장 : C(Cherbourg), Q(Queenstown), S(Southampton)	object
'''

### DataFrame 의 column dataset 에 access 하기
* DataFrame 의 column dataset 의 생성과 수정은 [] 연산자를 사용해서 수행함
* 새로운 column 에 값을 할당하는 경우,  []  안에 컬럼명을 입력하고 값을 할당함

In [ ]:
titanic_df.head()

In [ ]:
titanic_df["Age_0"] = 0
titanic_df.head()

In [ ]:
titanic_df["Age_by_10"] = titanic_df["Age"] * 10
titanic_df["Family_No"] = titanic_df["SibSp"] + titanic_df["Parch"] + 1
titanic_df.head(20)

In [ ]:
titanic_df["Age_by_10"] = titanic_df["Age_by_10"] + 100
titanic_df.head(20)

### DataFrame 데이터 삭제하기 - DataFrame 의 drop(컬럼명,axis=0/1) 메소드
* axis 를 지정해서 삭제하기

In [ ]:
drop_titanic_df = titanic_df.drop("Age_0", axis=1)
print("원본은 변형되지 않고, 변형된(지정한 컬럼이 삭제된) 새로운 DataFrame(drop_titanic_df) 을 반환함")
print("titanic_df 를 출력하면 변함이 없고 drop_titanic_df 를 출력해야 결과를 확인할 수 있음")
titanic_df.head(10)

In [ ]:
drop_titanic_df

### 여러 개의 column 삭제하기
* drop() 메소드 안에 argument로 삭제할 컬럼명으로 구성된 리스트를 넣어줌
* inplace=True 로 설정하면 원본이 변형됨 : inplace=False 가 default 값임
*  ㄴ 원본을 변형(원본에서 삭제함)되면서 새로운 DataFrame을 반환하지 않음

In [ ]:
titanic_df = pd.read_csv("titanic_train.csv")
titanic_df["Age_0"] = 0
titanic_df["Age_by_10"] = titanic_df["Age"] * 10
titanic_df["Family_No"] = titanic_df["SibSp"] + titanic_df["Parch"] + 1
titanic_df["Age_by_10"] = titanic_df["Age_by_10"] + 100
titanic_df.head()

In [ ]:
drop_df = titanic_df.drop(["Age_0", "Age_by_10", "Family_No"], axis=1, inplace=True)
print("inplace=True 로 설정했기 때문에 원본이 변형됨")
print("원본을 변형(원본에서 삭제함)되면서 새로운 DataFrame을 반환하지 않음")
print("drop_df :",drop_df)
titanic_df.head()

#### axis=0 이면 drop() 할 때 행(row) 방향으로 데이터를 삭제함

In [77]:
titanic_df = pd.read_csv("titanic_train.csv")
pd.set_option("display.width", 1000)
pd.set_option("display.max_colwidth", 15)

print("-- drop(axis=0) 하기 전 --")
titanic_df.head()

-- drop(axis=0) 하기 전 --

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
3            4         1       1  Futrelle, M...  female  35.0      1      0          113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450   8.0500   NaN        S

In [78]:
titanic_df.drop([0, 1, 2], axis=0, inplace=True)

print("-- drop(axis=0) 한 후 --")
titanic_df.head()

-- drop(axis=0) 한 후 --

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q
6            7         0       1  McCarthy, M...    male  54.0      0      0   17463  51.8625   E46        S
7            8         0       3  Palsson, Ma...    male   2.0      3      1  349909  21.0750   NaN        S